//******************************************************************************************
#ifndef _H_MGRANDOM_
#define _H_MGRANDOM_
//******************************************************************************************

#include "Singleton.h"

namespace  MG
{
    class MGRandom
    {
    public:
        MGRandom();
        ~MGRandom();
        SINGLETON_INSTANCE(MGRandom);

    public:
        //获得【a, b】之间的一个随机整数,   a<b
        U32 rand_ab_One(U32 min, U32 max);
		//通过2D坐标获取perlin数组的随机指
		I32 rand_perlin_2d( U32 x, U32 y );
		//通过2D坐标获取perlin数组随机指指向的坡度
		Vec3 rand_gradients_2d( U32 x, U32 y );
    };
}
//******************************************************************************************
#endif  //_H_MGRANDOM_
//******************************************************************************************